Revit 2026 API

# BuiltInFailuresBeamFailures Class

---

Failures about Beams.

SystemObject Autodesk.Revit.DBBuiltInFailuresBeamFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class BeamFailures
```
```vb
Public NotInheritable Class BeamFailures
```
```cpp
public ref class BeamFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BeamFailures = class end
```

The BuiltInFailuresBeamFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotBendBeamType | Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp. You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve. |

#### Reference

Autodesk.Revit.DB Namespace